import React, { useState } from 'react'
import Back from '../components/atoms/Back'

function Theme() {
  const [token, setToken] = useState("");
  const handleToken = () => {
    const token = [
      "三日月宗近","三日月宗近・極","小狐丸", "小狐丸・極", "石切丸", "石切丸・極",
      "岩融", "岩融・極", "今剣", "今剣・極", "大典太光世", "ソハヤノツルキ", "数珠丸恒次",
      "にっかり青江", "にっかり青江・極", "鬼丸国綱", "鳴狐", "鳴狐・極" , "一期一振", "一期一振・極",
      "鯰尾藤四郎", "鯰尾藤四郎・極", "骨喰藤四郎", "骨喰藤四郎・極", "平野藤四郎", "平野藤四郎・極",
      "厚藤四郎", "厚藤四郎・極", "後藤藤四郎", "後藤藤四郎・極", "信濃藤四郎", "信濃藤四郎・極",
      "前田藤四郎", "前田藤四郎・極", "秋田藤四郎", "秋田藤四郎・極", "博多藤四郎", "博多藤四郎・極",
      "乱藤四郎", "乱藤四郎・極", "五虎退", "五虎退・極", "薬研藤四郎", "薬研藤四郎・極",
      "包丁藤四郎", "包丁藤四郎・極", "大包平", "大包平・極", "鶯丸", "鶯丸・極", "明石国行", "明石国行・極",
      "蛍丸", "蛍丸・極", "愛染国俊", "愛染国俊・極", "千子村正", "千子村正・極", "蜻蛉切", "蜻蛉切・極",
      "物吉貞宗", "物吉貞宗・極", "太鼓鐘貞宗", "太鼓鐘貞宗・極", "亀甲貞宗", "亀甲貞宗・極",
      "燭台切光忠", "燭台切光忠・極", "大般若長光", "大般若長光・極", "小竜景光", "小竜景光・極",
      "江雪左文字", "江雪左文字・極", "宗三左文字", "宗三左文字・極", "小夜左文字", "小夜左文字・極",
      "加州清光", "加州清光・極", "大和守安定", "大和守安定・極", "歌仙兼定", "歌仙兼定・極", "和泉守兼定",
      "和泉守兼定・極", "陸奥守吉行", "陸奥守吉行・極", "山姥切国広", "山姥切国広・極", "山伏国広", "山伏国広・極",
      "堀川国広", "堀川国広・極", "蜂須賀虎徹", "蜂須賀虎徹・極", "浦島虎徹", "浦島虎徹・極", "長曽根虎徹", "長曽根虎徹・極",
      "髭切", "髭切特一", "髭切特二", "髭切特三", "髭切・極", "膝丸", "膝丸特一", "膝丸特二", "膝丸・極", "大倶利伽羅", "大倶利伽羅・極",
      "へし切長谷部", "へし切長谷部・極", "不動行光", "不動行光・極", "獅子王", "獅子王・極", "小烏丸",
      "抜丸", "同田貫正国", "同田貫正国・極", "鶴丸国永", "鶴丸国永・極", "太郎太刀", "太郎太刀・極", "次郎太刀", "次郎太刀・極",
      "日本号", "日本号・極", "御手杵", "御手杵・極", "巴形薙刀", "巴形薙刀・極", "毛利藤四郎", "毛利藤四郎・極",
      "篭手切江", "謙信景光", "謙信景光・極", "小豆長光", "小豆長光・極", "日向正宗", "日向正宗・極",
      "静形薙刀", "静形薙刀・極", "南泉一文字", "南泉一文字・極", "千代金丸", "千代金丸・極", "山姥切長義", "豊前江",
      "袮々切丸", "白山吉光", "南海太郎朝尊", "肥前忠広", "北谷菜切", "桑名江", "水心子正秀", "源清麿", "松井江",
      "山鳥毛", "古今伝授の太刀", "地蔵行平", "治金丸", "日光一文字", "太閤左文字", "五月雨江", "大千鳥十文字槍", "泛塵", "一文字則宗",
      "叢雲江", "姫鶴一文字", "福島光忠", "七星剣", "稲葉江", "笹貫"
    ]
    const newToken = token[Math.floor(Math.random() * token.length)];
    setToken("今日のお題は「" + newToken + "」です。");
  }

  return (
    <>
    <div className="content">
      <div className="flex-content">
        <h2>お題メーカー</h2>
        <button onClick={handleToken}>お題を出す</button>
        <div>{token}</div>
        <Back url="/app" />
      </div>
    </div>
    </>
  )
}

export default Theme